Tekla Open API Reference for Tekla Structures 2025
Color Class
 The Color class represents an RGB color with transparency. The color values must be between 0.0 and 1.0.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.UI.Color
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Color
<SerializableAttribute>
Public NotInheritable Class Color
The Color type exposes the following members.
Constructors
Name | Description
Color()
 Creates a new color object. The default object is black.
Color(Double, Double, Double)
 Creates a new color object with the given values.
Color(Double, Double, Double, Double)
 Creates a new color object with the given values.
Top
Properties
Name | Description
Blue
 The blue value of the color, between 0.0 and 1.0.
Green
 The green value of the color, between 0.0 and 1.0.
Red
 The red value of the color, between 0.0 and 1.0.
Transparency
 The transparency value of the color, between 0.0 (completely see-through) and 1.0 (completely solid).
Top
Examples
using Tekla.Structures.Model.UI;
public class Example
{
       public void Example1()
       {
           Color SolidGreen = new Color(0.0, 1.0, 0.0);
           Color SeeThroughBlue = new Color(0.0, 0.0, 1.0, 0.5);
       }
}
See Also
Reference
Tekla.Structures.Model.UI Namespace